redis_test_for_auto_numa_problem/redis_test_result_L_OFF_80G/memtier_benchmark_L_OFF_80G_Sequential110_P7_20230623181122.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       164316.57          ---          ---        17.69254        17.53500        23.03900        25.98300    350295.96 
Gets        16431.60     16431.60         0.00        17.53343        17.53500        21.24700        23.03900     34949.24 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     180748.17     16431.60         0.00        17.67808        17.53500        22.91100        25.85500    385245.21 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.687        0.000
SET      14.527        5.000
SET      16.319       10.000
SET      16.639       15.000
SET      16.767       20.000
SET      16.895       25.000
SET      17.151       30.000
SET      17.279       35.000
SET      17.407       40.000
SET      17.535       45.000
SET      17.535       50.000
SET      17.663       52.500
SET      17.663       55.000
SET      17.791       57.500
SET      17.919       60.000
SET      17.919       62.500
SET      18.047       65.000
SET      18.047       67.500
SET      18.175       70.000
SET      18.303       72.500
SET      18.431       75.000
SET      18.431       76.250
SET      18.559       77.500
SET      18.559       78.750
SET      18.687       80.000
SET      18.687       81.250
SET      18.815       82.500
SET      18.815       83.750
SET      18.943       85.000
SET      19.071       86.250
SET      19.199       87.500
SET      19.327       88.125
SET      19.327       88.750
SET      19.455       89.375
SET      19.583       90.000
SET      19.711       90.625
SET      19.839       91.250
SET      19.967       91.875
SET      20.095       92.500
SET      20.223       93.125
SET      20.479       93.750
SET      20.607       94.062
SET      20.735       94.375
SET      20.735       94.688
SET      20.863       95.000
SET      20.991       95.312
SET      21.119       95.625
SET      21.247       95.938
SET      21.375       96.250
SET      21.503       96.562
SET      21.631       96.875
SET      21.759       97.031
SET      21.759       97.188
SET      21.887       97.344
SET      22.015       97.500
SET      22.015       97.656
SET      22.143       97.812
SET      22.271       97.969
SET      22.399       98.125
SET      22.399       98.281
SET      22.527       98.438
SET      22.655       98.516
SET      22.655       98.594
SET      22.783       98.672
SET      22.783       98.750
SET      22.911       98.828
SET      22.911       98.906
SET      23.039       98.984
SET      23.167       99.062
SET      23.167       99.141
SET      23.295       99.219
SET      23.423       99.258
SET      23.423       99.297
SET      23.423       99.336
SET      23.551       99.375
SET      23.551       99.414
SET      23.679       99.453
SET      23.807       99.492
SET      23.807       99.531
SET      23.935       99.570
SET      24.063       99.609
SET      24.191       99.629
SET      24.191       99.648
SET      24.319       99.668
SET      24.319       99.688
SET      24.447       99.707
SET      24.575       99.727
SET      24.703       99.746
SET      24.831       99.766
SET      24.959       99.785
SET      25.087       99.805
SET      25.215       99.814
SET      25.215       99.824
SET      25.343       99.834
SET      25.343       99.844
SET      25.471       99.854
SET      25.599       99.863
SET      25.599       99.873
SET      25.727       99.883
SET      25.855       99.893
SET      25.983       99.902
SET      25.983       99.907
SET      26.111       99.912
SET      26.111       99.917
SET      26.239       99.922
SET      26.239       99.927
SET      26.367       99.932
SET      26.495       99.937
SET      26.495       99.941
SET      26.623       99.946
SET      26.751       99.951
SET      26.879       99.954
SET      27.007       99.956
SET      27.007       99.958
SET      27.135       99.961
SET      27.263       99.963
SET      27.391       99.966
SET      27.647       99.968
SET      27.903       99.971
SET      28.287       99.973
SET      28.671       99.976
SET      28.799       99.977
SET      29.055       99.978
SET      29.311       99.979
SET     206.847       99.980
SET     211.967       99.982
SET     235.519       99.983
SET     238.591       99.984
SET     239.615       99.985
SET     240.639       99.987
SET     242.687       99.988
SET     244.735       99.988
SET     244.735       99.989
SET     244.735       99.990
SET     276.479       99.990
SET     282.623       99.991
SET     282.623       99.991
SET     296.959       99.992
SET     299.007       99.993
SET     301.055       99.993
SET     303.103       99.994
SET     303.103       99.994
SET     303.103       99.995
SET     303.103       99.995
SET     305.151       99.995
SET     305.151       99.995
SET     305.151       99.996
SET     305.151       99.996
SET     307.199       99.996
SET     307.199       99.997
SET     307.199       99.997
SET     307.199       99.997
[...]
SET     307.199       99.998
SET     309.247       99.998
SET     311.295       99.998
SET     333.823       99.998
SET     333.823       99.998
SET     333.823       99.998
[...]
SET     339.967       99.999
SET     339.967       99.999
SET     339.967       99.999
[...]
SET     339.967      100.000
SET     339.967      100.000
SET     339.967      100.000
[...]
SET    1048.575      100.000
SET    1048.575      100.000
---
GET       1.359        0.000
GET      14.527        5.000
GET      16.255       10.000
GET      16.639       15.000
GET      16.767       20.000
GET      16.895       25.000
GET      17.023       30.000
GET      17.151       35.000
GET      17.279       40.000
GET      17.407       45.000
GET      17.535       50.000
GET      17.663       52.500
GET      17.663       55.000
GET      17.791       57.500
GET      17.791       60.000
GET      17.919       62.500
GET      17.919       65.000
GET      18.047       67.500
GET      18.047       70.000
GET      18.175       72.500
GET      18.303       75.000
GET      18.303       76.250
GET      18.431       77.500
GET      18.431       78.750
GET      18.431       80.000
GET      18.559       81.250
GET      18.559       82.500
GET      18.687       83.750
GET      18.815       85.000
GET      18.815       86.250
GET      18.943       87.500
GET      18.943       88.125
GET      19.071       88.750
GET      19.071       89.375
GET      19.071       90.000
GET      19.199       90.625
GET      19.327       91.250
GET      19.327       91.875
GET      19.455       92.500
GET      19.583       93.125
GET      19.583       93.750
GET      19.711       94.062
GET      19.711       94.375
GET      19.839       94.688
GET      19.839       95.000
GET      19.967       95.312
GET      19.967       95.625
GET      20.095       95.938
GET      20.223       96.250
GET      20.223       96.562
GET      20.351       96.875
GET      20.479       97.031
GET      20.479       97.188
GET      20.479       97.344
GET      20.607       97.500
GET      20.607       97.656
GET      20.735       97.812
GET      20.735       97.969
GET      20.863       98.125
GET      20.863       98.281
GET      20.991       98.438
GET      20.991       98.516
GET      20.991       98.594
GET      21.119       98.672
GET      21.119       98.750
GET      21.119       98.828
GET      21.247       98.906
GET      21.247       98.984
GET      21.375       99.062
GET      21.375       99.141
GET      21.503       99.219
GET      21.503       99.258
GET      21.503       99.297
GET      21.503       99.336
GET      21.631       99.375
GET      21.631       99.414
GET      21.631       99.453
GET      21.759       99.492
GET      21.759       99.531
GET      21.887       99.570
GET      21.887       99.609
GET      22.015       99.629
GET      22.015       99.648
GET      22.015       99.668
GET      22.143       99.688
GET      22.143       99.707
GET      22.271       99.727
GET      22.271       99.746
GET      22.399       99.766
GET      22.399       99.785
GET      22.527       99.805
GET      22.527       99.814
GET      22.655       99.824
GET      22.655       99.834
GET      22.783       99.844
GET      22.783       99.854
GET      22.911       99.863
GET      22.911       99.873
GET      23.039       99.883
GET      23.039       99.893
GET      23.039       99.902
GET      23.167       99.907
GET      23.167       99.912
GET      23.167       99.917
GET      23.167       99.922
GET      23.295       99.927
GET      23.295       99.932
GET      23.295       99.937
GET      23.423       99.941
GET      23.423       99.946
GET      23.423       99.951
GET      23.423       99.954
GET      23.551       99.956
GET      23.551       99.958
GET      23.551       99.961
GET      23.551       99.963
GET      23.551       99.966
GET      23.679       99.968
GET      23.679       99.971
GET      23.807       99.973
GET      23.935       99.976
GET      23.935       99.977
GET      24.319       99.978
GET      24.959       99.979
GET     206.847       99.980
GET     210.943       99.982
GET     234.495       99.983
GET     238.591       99.984
GET     238.591       99.985
GET     240.639       99.987
GET     241.663       99.988
GET     242.687       99.988
GET     244.735       99.989
GET     244.735       99.990
GET     272.383       99.990
GET     276.479       99.991
GET     282.623       99.991
GET     282.623       99.992
GET     296.959       99.993
GET     301.055       99.993
GET     303.103       99.994
GET     303.103       99.994
GET     303.103       99.995
GET     303.103       99.995
GET     303.103       99.995
GET     305.151       99.995
GET     305.151       99.996
GET     305.151       99.996
GET     305.151       99.996
GET     307.199       99.997
GET     307.199       99.997
GET     307.199       99.997
[...]
GET     307.199       99.998
GET     307.199       99.998
GET     307.199       99.998
GET     329.727       99.998
GET     333.823       99.998
GET     333.823       99.998
GET     333.823       99.998
GET     335.871       99.999
GET     339.967       99.999
GET     339.967      100.000
---
WAIT      0.000      100.000